#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azuread_application.ACR-access-app: Refreshing state... [id=2e293956-b8a5-4ff5-92e6-2b3c355cbaec]
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=e2584cbb-77a2-443d-b6c7-e3436ddf47eb-00685ac7-79c2-49be-91b5-9996f272ffab-4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3]
azuread_application_password.ACR-access-app-password: Refreshing state... [id=2e293956-b8a5-4ff5-92e6-2b3c355cbaec/password/cb7bc7f7-d121-492a-a26a-a06ba3c88b3a]
github_actions_secret.example_secret: Refreshing state... [id=Project-F:AcrAccessSecret]
azurerm_resource_group.rg-projectf-dev-001: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-001]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-07-29 21:06:24.221702313 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.acr-dev will be created
  + resource "azurerm_container_registry" "acr-dev" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + login_server                  = (known after apply)
      + name                          = "acrprojectfdev001"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-projectf-dev-002"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "CreatedBy" = "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_resource_group.rg-projectf-dev-002 will be created
  + resource "azurerm_resource_group" "rg-projectf-dev-002" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg-projectf-dev-002"
      + tags     = {
          + "CreatedBy" = "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3"
        }
    }

  # azurerm_role_assignment.acr-role-assignment-dev will be created
  + resource "azurerm_role_assignment" "acr-role-assignment-dev" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2e293956-b8a5-4ff5-92e6-2b3c355cbaec"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*